# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
#Your code here
import sqlite3
conn = sqlite3.connect("data.sqlite")
c = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [6]:
#Your code here
import pandas as pd
c.execute("""select firstName, lastName, city, state from employees e
             join customers c
             on e.employeeNumber==c.salesRepEmployeeNumber
             order by firstName, lastName""")
df = pd.DataFrame(c.fetchall())
df.head()

      0       1               2           3
0  Andy  Fixter       Chatswood         NSW
1  Andy  Fixter    Glen Waverly    Victoria
2  Andy  Fixter       Melbourne    Victoria
3  Andy  Fixter    North Sydney         NSW
4  Andy  Fixter  South Brisbane  Queensland

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [7]:
# Your code here
c.execute("""select firstName, lastName, orderNumber, orderDate, status from employees e
             join customers c on e.employeeNumber==c.salesRepEmployeeNumber
             join orders o using (customerNumber)
             """)
df = pd.DataFrame(c.fetchall())
df.head()

        0         1      2           3        4
0  Leslie  Jennings  10113  2003-03-26  Shipped
1  Leslie  Jennings  10135  2003-07-02  Shipped
2  Leslie  Jennings  10142  2003-08-08  Shipped
3  Leslie  Jennings  10182  2003-11-12  Shipped
4  Leslie  Jennings  10229  2004-03-11  Shipped

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [8]:
# Your code here
c.execute("""select contactFirstName, contactLastName, amount,paymentDate from customers c
             join payments p using (customerNumber)
             order by amount desc""")
df = pd.DataFrame(c.fetchall())
df.head()

         0         1        2           3
0  Violeta   Benitez  9977.85  2003-11-08
1      Ben  Calaghan  9821.32  2003-10-17
2   Leslie    Taylor  9658.74  2004-12-06
3     Sean  Clenahan  9415.13  2004-07-28
4  Roland     Mendel  8807.12  2005-05-03

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [17]:
# Your code here
c.execute("""select contactFirstName, contactLastName, productName, quantityOrdered, orderDate
             from products P
             join orderdetails using (productCode)
             join orders using (orderNumber)
             join customers using(customerNumber)
             order by orderDate desc""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df.head()

2996

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Diego,Freyre,1952 Alpine Renault 1300,50,2005-05-31
1,Janine,Labrune,1962 LanciaA Delta 16V,38,2005-05-31
2,Diego,Freyre,1958 Setra Bus,49,2005-05-31
3,Janine,Labrune,1957 Chevy Pickup,33,2005-05-31
4,Diego,Freyre,1940 Ford Pickup Truck,54,2005-05-31

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!